{
  "AnotherBeer": {
    "text": "You get so drunk that you don't realize what's going on in this small town. The entire place is overrun with murderers who are trying to win the village of the year festival. They kill you in your sleep because you keep an ugly shrub in your garden."
  }, 
  "Back": {
    "text": "To be continued..."
  }, 
  "BashWithHandlebars": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "You stick the handlebars into the fish's cranium and attempt to steer it as though it were a bicycle. You crash into a tree and die."
  }, 
  "BearMauling": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "Your friend gets off in a huff, and leaves you stranded in a forest. A bear arrives and disembowels you in a single mauling motion. You succumb to your injuries."
  }, 
  "Beginning": {
    "choices": [
      {
        "node": "Front", 
        "text": "Front"
      }, 
      {
        "node": "Back", 
        "text": "Back"
      }, 
      {
        "node": "Sidecar", 
        "text": "Sidecar"
      }
    ], 
    "image": "beginning", 
    "music": "", 
    "text": "In the beginning...You are riding a tandem bicycle. Which seat are you on?"
  }, 
  "BreakEggs": {
    "choices": [
      {
        "node": "ConfirmEggBreaking", 
        "text": "Yep!"
      }, 
      {
        "node": "EscapeNest", 
        "text": "Nope!"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "Are you sure you want to break the eggs?"
  }, 
  "ChoseFriend": {
    "choices": [
      {
        "node": "None", 
        "text": "Grunge(TBD)"
      }, 
      {
        "node": "None", 
        "text": "Organ Chorale(TBD)"
      }, 
      {
        "node": "YouShouldBeDancing", 
        "text": "High voiced 70s group"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "And when the sky outside was blue and you had nothing else to do, you happened upon your friend from many years past. Because you go back a ways, she agrees to help you get this tandem bicycle going up the hill. What is your soundtrack of choice?"
  }, 
  "ChoseSalmon": {
    "choices": [
      {
        "node": "NextHill", 
        "text": "On to the next hill!"
      }, 
      {
        "node": "PutFishInWater", 
        "text": "Get some water"
      }, 
      {
        "node": "Resuscitate", 
        "text": "Resuscitate the fish"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You pick up the carcass of an Atlantic salmon that was sitting on the road side. As shown in an fMRI study, a dead salmon has the ability to do complex social processing. It miraculously starts pedaling in the back seat and you make it up the hill. What do you do next?"
  }, 
  "ConfirmEggBreaking": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "You go to town on the eggs and soon find yourself face to face with a giant, angry 'was' soon-to-be-mother duck. She snaps your neck and you pass..."
  }, 
  "ConfirmSidecar": {
    "choices": [
      {
        "node": "RideWithDucks", 
        "text": "See where they take me"
      }, 
      {
        "node": "ElectricSlide", 
        "text": "Do the electric slide"
      }, 
      {
        "node": "JumpAndRoll", 
        "text": "Jump out and roll"
      }
    ], 
    "text": "FINE! Fine, fine. Sidecar it is, then (you little prick). You *were* riding a tandem bicycle, but then you were kicked off into the side car. There are two ducks pedaling the bicycle and you have no control. What do you do?"
  }, 
  "Default": {
    "choices": [
      {
        "node": "Beginning", 
        "text": "Game"
      }, 
      {
        "node": "Beginning", 
        "text": "Over."
      }, 
      {
        "node": "Beginning", 
        "text": "Restart?"
      }
    ], 
    "image": "", 
    "music": "", 
    "startNode": "Beginning", 
    "text": "GAME OVER."
  }, 
  "DistrustFriend": {
    "choices": [
      {
        "node": "BearMauling", 
        "text": "Sorry, I can't..."
      }, 
      {
        "node": "TrustFriend", 
        "text": "Let's go!"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You are hesitant, as everyone else is, around your friend. You begin to think that she got her reputation as a pathological liar for a reason. However, she is willing to give you one more chance for the adventure of a lifetime. What say you?"
  }, 
  "DragonSlap": {
    "choices": [
      {
        "node": "Beginning", 
        "text": "Congrats,"
      }, 
      {
        "node": "Beginning", 
        "text": "You're a"
      }, 
      {
        "node": "Beginning", 
        "text": "WINNER!"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "That's what I'm talking about! You fiercely slap the crap out of that dragon asking it 'Who's your daddy?' over and over. You are hailed as a hero and a great master of guise! You live your life comfortably among the ducks. Congrats on the win, you wild animal!"
  }, 
  "Dysentery": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "You died of dysentery."
  }, 
  "ElectricSlide": {
    "choices": [
      {
        "node": "WentToPub", 
        "text": "I don't know...pub?"
      }, 
      {
        "node": "RollAndDie", 
        "text": "Roll when you land"
      }, 
      {
        "node": "FlyHigh", 
        "text": "Fly high through the sky!"
      }
    ], 
    "text": "You balance yourself awkwardly on the sidecar and start strutting your stuff. The ducks get distracted and also begin to do the electric slide (in place...somehow). They lose control of the bicycle and crash into a tree. You are flying through the air...what's your plan?"
  }, 
  "EscapeNest": {
    "choices": [
      {
        "node": "SwordBreath", 
        "text": "Sword"
      }, 
      {
        "node": "Fishy", 
        "text": "What the hell! Grab a fishy!"
      }, 
      {
        "node": "DragonSlap", 
        "text": "Slap that dragon!"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You climb out of the nest and find yourself in the sidecar once again, arriving at the ducks' destination, you find yourself in a forest clearing with a large dragon. The ducks, now in full sets of chain mail, politely ask you to help kick that dragon's ass. What is your weapon of choice?"
  }, 
  "FallAndRoll": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "You fall from the sidecar, and the arrow breaks off during your roll. You sight a nearby duck town, and offer your services as a town guard. You tell all passersby about the day you took an arrow to the knee. You inevitably die a miserable death, knowing full well that you wasted your pathetic existence."
  }, 
  "FindPassengers": {
    "choices": [
      {
        "node": "None", 
        "text": "The Nun(TBD)"
      }, 
      {
        "node": "ChoseFriend", 
        "text": "The Childhood Friend"
      }, 
      {
        "node": "ChoseSalmon", 
        "text": "Dead salmon on roadside"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You search for potential passengers, and happen upon a nun, a friend from your childhood, and a large Atlantic salmon. Which do you select?"
  }, 
  "FindWater": {
    "choices": [
      {
        "node": "Beginning", 
        "text": "You did well!"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You spot a lake nearby, and pedal the bicycle furiously with the gasping fish in your arms. You place it into the water just in time, and watch as the fish swims away, jumping up to wave its sacral fin back at you. You know you did a good thing today."
  }, 
  "Fishy": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "You go insane with gusto and violently beat the dragon to death with a random fishy you find in a creek nearby! Disgusted, the heroic ducks now turn on you. You bash their heads in with the same fishy you mercilessly pulled from its home. Settling down after the fight, you realize the horror of what you've done. You build a monument for the ducks, dragon, and most of all the poor fishy, spending the rest of your life bathing them in your sorrowful tears."
  }, 
  "FlyHigh": {
    "choices": [
      {
        "node": "Beginning", 
        "text": "Back to the beginning?"
      }, 
      {
        "node": "Dysentery", 
        "text": "To the end?"
      }, 
      {
        "node": "RandomNode", 
        "text": "Somewhere else?"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You soar like an eagle through the sky. Where do you want to go?"
  }, 
  "Front": {
    "choices": [
      {
        "node": "FindPassengers", 
        "text": "Look for a passenger"
      }, 
      {
        "node": "GoAlone", 
        "text": "Go it yourself"
      }, 
      {
        "node": "TryToFly", 
        "text": "Fly"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "Okay, you want to be the diva, don't you? Well, congratulations! You're the star! You are driving a tandem bicycle, and come upon a hill that may be too steep for you. What do you do?"
  }, 
  "GetSoda": {
    "choices": [
      {
        "node": "GetSodaResult", 
        "text": "Yeah...?"
      }, 
      {
        "node": "GetSodaResult", 
        "text": "Um...no?"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "Really? You're just going to leave the fish there?"
  }, 
  "GetSodaResult": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "Well, you chose to grab a soda, but the shopkeep noticed you leaving the fish in the street and throws in some mentos and poprocks with your purchase. Your stomach ruptures and you ebb away."
  }, 
  "GoAlone": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "You attempt to pilot the heavy bicycle up the hill, but to no avail. You collapse from exhaustion, inconveniently falling over into an open manhole. You break your neck and wane from existence."
  }, 
  "GoToSleep": {
    "choices": [
      {
        "node": "None", 
        "text": "Hear him out (TBD)"
      }, 
      {
        "node": "StabWithPole", 
        "text": "Stab with pole"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You are awoken in the middle of the night by a random stranger in your room. You could try to fight him with your fishing pole, but he is much bigger than you. Alternatively, you could hear what he has to say. What is your choice?"
  }, 
  "HelpManHome": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "You and your fat friend Mack Snow help the poor man home. He is found dead the next day. You are arrested and sentenced to life in prison. Your 'friend' gets an ice cream cake."
  }, 
  "HitBySheriff": {
    "choices": [
      {
        "node": "HitBySheriff2", 
        "text": "Continue"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You carelessly run into the street shouting after your friend, who clearly just stole your precious tandem bicycle. Suddenly, you black out and awaken in the hospital. You were hit by the town sheriff who was too busy checking out your mom at your house to see you run out in front of his car."
  }, 
  "HitBySheriff2": {
    "choices": [
      {
        "node": "None", 
        "text": "(TBD)"
      }, 
      {
        "node": "None", 
        "text": "(TBD)"
      }, 
      {
        "node": "None", 
        "text": "(TBD)"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You are in a hospital bed. The sheriff who ran you over is by your side, apologizing profusely. What will you do?"
  }, 
  "HulaDance": {
    "choices": [
      {
        "node": "Beginning", 
        "text": "Continue"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "The ducks do the hula with you, and everyone has a good time. You are crippled severely by the arrow, marking your disobedience. You faint, and later awaken to find yourself once again riding a tandem bicycle."
  }, 
  "JumpAndRoll": {
    "choices": [
      {
        "node": "HulaDance", 
        "text": "Hula dance your way out"
      }, 
      {
        "node": "FallAndRoll", 
        "text": "Fall off and roll"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "The rear avian notices you readying your jump, and out of nowhere produces a hellish bow and arrow. He looses the arrow, and it hits you in the knee."
  }, 
  "JumpInVortex": {
    "choices": [
      {
        "node": "Front", 
        "text": "Front"
      }, 
      {
        "node": "Back", 
        "text": "Back"
      }, 
      {
        "node": "Sidecar", 
        "text": "Sidecar"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You hop into the vortex and start to fall...fast. You feel massive forces pulling and ripping at your body. Everything slowly subsides and you find yourself gently lowered onto a tandem bicycle. Which seat do you take?"
  }, 
  "KeepWatchingStruggle": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "An aneurism in your brain begins to bleed from your sick excitement and you fade into oblivion and die."
  }, 
  "ListenToFish": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "You approach. The fish whimpers: \"Somewhere deep down in my heart...I still LOVE YOU\" and passes into the mist. You let out a long sob and, forgetting to breathe, suffocate and die."
  }, 
  "LookAtVortex": {
    "choices": [
      {
        "node": "NewBeginning", 
        "text": "Continue"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You stare longingly into the vortex of emptiness. You see...nothing.\nNo, wait! You see something! You see...you see...YOU SEE..."
  }, 
  "LookAway": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "You look back on the collapsing universe and both of your eyes are pierced by trombones. You don't see it coming, but a train comes at you and bashes your head in. Your pathetic soul wanes."
  }, 
  "NewBeginning": {
    "choices": [
      {
        "node": "Front", 
        "text": "Front"
      }, 
      {
        "node": "Back", 
        "text": "Back"
      }, 
      {
        "node": "Sidecar", 
        "text": "Sidecar"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "A tandem bicycle. Which seat are you on?"
  }, 
  "NextHill": {
    "choices": [
      {
        "node": "Beginning", 
        "text": "Good job!"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "With your blind ambition and sheer lack of tact, you and the fish go on to win the Tour de France for two years straight. The fish never lets you down, and never runs around and hurts you."
  }, 
  "PutFishInWater": {
    "choices": [
      {
        "node": "LookAtVortex", 
        "text": "Look into vortex"
      }, 
      {
        "node": "JumpInVortex", 
        "text": "Jump into vortex"
      }, 
      {
        "node": "LookAway", 
        "text": "Look away"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You place the fish in a container of water, wherein the entire container transforms into a cat with a piece of buttered toast on its back and it begins falling toward the ground. The cat spins uncontrollably, forming a vortex that rips apart the universe. What do you do?"
  }, 
  "Resuscitate": {
    "choices": [
      {
        "node": "ChoseSalmon", 
        "text": "Oh, nevermind."
      }, 
      {
        "node": "Resuscitate?", 
        "text": "Yes! He needs me!"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "The fish is completely dead. Still attempt to resuscitate?"
  }, 
  "ResuscitateFailure": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "[FAILED] You attempt to bring the fish back to life, using full mouth-to-mouth. People notice and are appalled. You live the rest of your life as an outcast and social pariah."
  }, 
  "ResuscitateSuccess": {
    "choices": [
      {
        "node": "FindWater", 
        "text": "Find a body of water"
      }, 
      {
        "node": "GetSoda", 
        "text": "Go get a soda"
      }, 
      {
        "node": "WatchStruggle", 
        "text": "Watch it struggle"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "[SUCCESS] The fish, against all expectations, returns from Valhalla to the land of the living. What do you do?"
  }, 
  "RideWithDucks": {
    "choices": [
      {
        "node": "BreakEggs", 
        "text": "Break you some eggs!"
      }, 
      {
        "node": "EscapeNest", 
        "text": "Climb out and escape!"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You give up and just let the ducks drive you to their destination...what seems like hours later you wake up to find yourself alone in some sort of giant nest with eggs."
  }, 
  "RollAndDie": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "You try to roll, but since you have no training whatsoever you land directly on your head and die on impact. The ducks live happy and fulfilling lives and keep your head on their trophy shelf."
  }, 
  "SendKidsHome": {
    "choices": [
      {
        "node": "HelpManHome", 
        "text": "Yes"
      }, 
      {
        "node": "StickAround", 
        "text": "No"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You go through the boys one by one, asking them their respective birthdays. With each feeble response, you just say 'Out!' When you are done, the pub is pretty much empty. There is one man who had too much to drink. Will you help him get home?"
  }, 
  "Sidecar": {
    "choices": [
      {
        "node": "Front", 
        "text": "Front"
      }, 
      {
        "node": "Back", 
        "text": "Back"
      }, 
      {
        "node": "ConfirmSidecar", 
        "text": "Sidecar, dammit!"
      }
    ], 
    "image": "sidecar", 
    "music": "", 
    "text": "A TANDEM bicycle. Which seat are you on?"
  }, 
  "SlighshotToEye": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "You call to your friend: 'Hey! I thought we weren't meeting until 8:30?' She responds: 'I told you not to tell anybody!' She pulls a slingshot from under her garb and looses some lead shot. It goes through your eye and mashes your brain. You pass."
  }, 
  "StabWithPole": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "You pick up your fishing rod and take a hard jab at the assailant. The stranger shrieks and falls over, all of the padding falling off of her costume to reveal that you just stabbed your childhood friend through the heart with a fishing pole. You lose control of your trembling body and fall out of the window by your bed. You break your neck and decay into darkness."
  }, 
  "StayUpLate": {
    "choices": [
      {
        "node": "GoToSleep", 
        "text": "Pretend to sleep"
      }, 
      {
        "node": "SlighshotToEye", 
        "text": "Call to her"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You are so excited about the next morning, that you simply cannot bring youself to sleep. Around midnight, you hear a noise outside your window. You take a look and see your friend putting on some sort of costume."
  }, 
  "StickAround": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "Your friend Johnny McPorkins helps the poor drunk home while you enjoy the empty pub. You catch a play, live a good life, and somehow forget that you were a crazy person who once chose the sidecar of a tandem bicycle."
  }, 
  "SwordBreath": {
    "choices": [], 
    "image": "swordbreath", 
    "music": "", 
    "text": "Unfortunately, this is a sword-breathing dragon. Its 1,000,000 swords beat your one sword. You are impaled many times and die."
  }, 
  "TrustFriend": {
    "choices": [
      {
        "node": "GoToSleep", 
        "text": "Go to sleep"
      }, 
      {
        "node": "HitBySheriff", 
        "text": "Hey! My bike!"
      }, 
      {
        "node": "StayUpLate", 
        "text": "Stay up all night"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "Your friend insists that you tell nobody of the trip...and she means NOBODY. Everyone thinks that the gold in the mountain is a myth, but not her. You arrive back at home and your friend drops you off and rides off on the tandem bicycle. She calls that she will meet you tomorrow at 8:30am as she departs."
  }, 
  "TryToFly": {
    "choices": [], 
    "image": "", 
    "music": "", 
    "text": "You jump off a nearby cliff, only to find that you are unable to fly. You die on impact with the ground below, much to the horror of some bystanders."
  }, 
  "WatchStruggle": {
    "choices": [
      {
        "node": "ListenToFish", 
        "text": "Do as it asks"
      }, 
      {
        "node": "KeepWatchingStruggle", 
        "text": "Keep watching struggle"
      }, 
      {
        "node": "BashWithHandlebars", 
        "text": "Bash with handlebars"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You have zero empathy, don't you? The fish motions for you to approach. How do you respond?"
  }, 
  "WentToPub": {
    "choices": [
      {
        "node": "AnotherBeer", 
        "text": "How about another beer?"
      }, 
      {
        "node": "SendKidsHome", 
        "text": "Send them all home"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "You arrive at the small-town pub with your large friend in tow, but when you arrive inside you find a bunch of underage scum drinking and loudening up the place. What's your perogative, Sergeant Angle?"
  }, 
  "YouShouldBeDancing": {
    "choices": [
      {
        "node": "DistrustFriend", 
        "text": "She's crazy!"
      }, 
      {
        "node": "TrustFriend", 
        "text": "Let's do this!"
      }
    ], 
    "image": "", 
    "music": "", 
    "text": "Now there's some nostalgia! You know you should be dancing, as the catchy rhythm and your imagination of the tight-pants-wearing men in the band infects your soul. You rock it up the hill, and your friend insists that if you go to a mountain 15 miles from here, you could both become rich!"
  }
}